lovery-tian/university-coursework/大三下学期/嵌入式综合实训/原厂-项目2-智能交通灯/1、程序源文件（C语言，详细备注）/stm32-085、程序-C8T6/USER/mygpio.h
#ifndef __MYGPIO_H
#define __MYGPIO_H	 

#include "stm32f10x.h"
#include "delay.h"

typedef enum
{ 
PA0=0, PA1, PA2, PA3, PA4, PA5, PA6, PA7, PA8, PA9, PA10, PA11, PA12, PA13, PA14, PA15,
  PB0, PB1, PB2, PB3, PB4, PB5, PB6, PB7, PB8, PB9, PB10, PB11, PB12, PB13, PB14, PB15, 
  PC0, PC1, PC2, PC3, PC4, PC5, PC6, PC7, PC8, PC9, PC10, PC11, PC12, PC13, PC14, PC15, 
  PD0, PD1, PD2, PD3, PD4, PD5, PD6, PD7, PD8, PD9, PD10, PD11, PD12, PD13, PD14, PD15, 
  PE0, PE1, PE2, PE3, PE4, PE5, PE6, PE7, PE8, PE9, PE10, PE11, PE12, PE13, PE14, PE15, 
  PF0, PF1, PF2, PF3, PF4, PF5, PF6, PF7, PF8, PF9, PF10, PF11, PF12, PF13, PF14, PF15, 
  PG0, PG1, PG2, PG3, PG4, PG5, PG6, PG7, PG8, PG9, PG10, PG11, PG12, PG13, PG14, PG15, 
}MyPinDef;
#ifndef	BITBAND
#define BITBAND(addr, bitnum) ((addr & 0xF0000000)+0x2000000+((addr &0xFFFFF)<<5)+(bitnum<<2)) 
#endif
#ifndef	MEM_ADDR
#define MEM_ADDR(addr)  *((volatile unsigned long  *)(addr)) 
#endif
#ifndef	BIT_ADDR
#define BIT_ADDR(addr, bitnum)   MEM_ADDR(BITBAND(addr, bitnum)) 
#endif 
#ifndef	GPIOA_ODR_Addr
#define GPIOA_ODR_Addr    (GPIOA_BASE+12) //0x4001080C 
#endif 
#ifndef	GPIOA_IDR_Addr
#define GPIOA_IDR_Addr    (GPIOA_BASE+8) //0x40010808 
#endif 
#define PinOut(n)   BIT_ADDR(GPIOA_ODR_Addr+0x400*(n/16),n%16)  //Êä³ö

uint32_t GetGPIO_RCC(MyPinDef pin);
GPIO_TypeDef* GetGPIO_Port(MyPinDef pin);
uint16_t GetGPIO_PIN(MyPinDef pin);
void GPIO_SetOutput(MyPinDef pin);
void GPIO_SetInput(MyPinDef pin);
void SetPin(MyPinDef pin);
void ResetPin(MyPinDef pin);
void PinOutBit(MyPinDef pin, uint8_t bitNum);
uint8_t ReadPin(MyPinDef pin);
		 				    
#endif
